var rules_text =
    /*html*/
    `<h1 class="all-text">1 Общее положение:</h1>
<p class="all-text">1.1 Проект основан на режиме RolePlay. Все действия происходят в вымышленном мире штата "San Andreas". Штат расположен в США. Поэтому действиястоит отыгрывать, опираясь на американскую модель поведения и манеру общения, а именно:Толерантное отношение ко всем социальным меньшинствам, религиозным группам, расам и национальностям. Уважительное отношение к сотрудникам правоохранительных органов.  Густонаселенность в городской и сельской местностях, а также постоянное присутствие людей в публичных местах.</p>
<p class="all-text">1.2 Время на серверах соответствует реальному времени по часовому поясу GMT+3 (Москва).</p>
<p class="all-text">1.3 Игровой год на сервере соответствует годам в реальном времени.</p>
<p class="all-text">1.4 Создавая игровой аккаунт, игрок соглашается со всеми правилами проекта и сервера, на котором он играет. Правила серверов доступны на данном форуме, в разделе каждого сервера, ссылки прикреплены в приложении 1. Правила серверовмогут расширять или переопределять некоторые пункты данных правил.</p>
<p class="all-text">1.5 Незнание правил проекта/сервера не освобождает игрока от ответственности за их нарушение.</p>
<p class="all-text">1.6 Корректировки правил проекта/сервера могут вноситься в любой момент, незнание актуальной версии правил не освобождает от ответственности за их нарушение.</p>
<p class="all-text">1.7 Запрещено использование, а также хранение любых читов, модов, программ, скриптов и модификаций, дающих преимущество над другими игроками, в том числе встроенного в периферию (клавиатуру/мышку), а также любых технических модификаций или нестандартных методов использования периферии. | Блокировка от 3 дней/Перманентная блокировка аккаунта/Черный список проекта.</p>
`;